Repository: Ishtef/NVDAExtensionGlobalPlugin
Catalog: addon/locale/*/LC_MESSAGES/nvda.po
Languages: ar

source: detailed description
ar: وصف مفصل

source: The multiple contiguous spaces
ar: المسافات المتجاورة المتعددة

source: The space or Tab at end
ar: المسافة أو علامة الجدولة في النهاية

source: The isolated or non spaced punctuations
ar: علامات الترقيم المعزولة أو غير المتباعدة

source: The uppercase missing or inversed
ar: الأحرف الكبيرة مفقودة أو مقلوبة

source: The required space before the symbol
ar: المساحة المطلوبة قبل الرمز

source: The required space after the symbol
ar: المساحة المطلوبة بعد الرمز

source: unexpected space before symbol
ar: مسافة غير متوقعة قبل الرمز

source: unexpected space after symbol
ar: مسافة غير متوقعة بعد الرمز

source: Font's name
ar: اسم الخط

source: Font's size
ar: حجم الخط

source: Font's attributes
ar: سمات الخط

source: Style
ar: أسلوب

source: Color
ar: اللون

source: Text analyzer activated
ar: تم تفعيل محلل النص

source: Text analyzer desactivated
ar: تم إلغاء تنشيط محلل النص

source: Quick addons activation
ar: سرعة تنشيط الإضافات

source: Check to activate:
ar: فحص للإضافات النشطة:

source: &Check all
ar: تحديد ال&كل:

source: &Uncheck all
ar: ال&غاء تحديد الكل

source: &Save and restart NVDA
ar: &حفظ وإعادة تشغيل NVDA

source: All add-ons are checked
ar: تم فحص جميع الوظائف الإضافية

source: All add-ons unchecked
ar: لم يتم تحديد جميع الوظائف الإضافية

source: There is no change. Do you want to restart NVDA anyway?
ar: لا يوجد أي تغيير. هل تريد إعادة تشغيل NVDA على أي حال؟

source: Error: the "%s" folder cannot be deleted
ar: خطأ: لا يمكن حذف المجلد " %s"

source: User Configurations's management
ar: إدارة تكوينات المستخدم

source: Configuration's &folders:
ar: &مجلدات التكوين

source: &Restart NVDA with this configuration's folder
ar: إ&عادة تشغيل NVDA لتكوين هذا المجلد

source: &Prepare this folder
ar: &تحضير هذا المجلد

source: &Delete this folder
ar: &حذف هذا المجلد

source: Empt&y this folder
ar: إ&فراغ هذا المجلد

source: E&xplore this folder
ar: &استكشاف هذا المجلد

source: Add &new folder
ar: إ&ضافة مجلد جديد

source: Add &existing folder
ar: إ&ضافة مجلد موجود

source: &Modify this folder
ar: ت&عديل هذا المجلد

source: Active configuration
ar: التكوين النشط

source: Do you really want to restart NVDA with this user configuration's folder: %s?
ar: هل تريد حقًا إعادة تشغيل NVDA بمجلد تكوين هذا المستخدم: %s؟

source: You are going to modify the active configuration's folder. Do you want to continue?
ar: أنت بصدد تعديل مجلد التكوين النشط. هل تريد الاستمرار؟

source: Impossible to create %s folder
ar: إستحالة إنشاء مجلد %s

source: Active configuration path cannot be deleted
ar: لا يمكن حذف مسار التكوين النشط

source: Do you really want to delete the "%s" folder?
ar: هل تريد حقًا حذف المجلد " %s"؟

source: The folder %s is already empty
ar: المجلد %s فارغ بالفعل

source: Do you really want to delete all the content of the "%s" folder?
ar: هل تريد حقًا حذف كافة محتويات المجلد " %s"؟

source: End of deletion
ar: نهاية الحذف

source: Preparation of %s folder
ar: تحضير مجلد %s

source: Import from &folder:
ar: & استيراد من مجلد:

source: Import &add-ons
ar: استيراد &الإضافات

source: Import speech &dictionaries
ar: استيراد النطق &القواميس

source: Import ponctuation/symbol &pronunciations
ar: &استيراد التنقيط / الرمز النطق

source: Import input &gesture changes
ar: ا&ستيراد تغييرات الإدخال والإيماءات

source: Import configuration p&rofiles
ar: استيراد ملفات تعريف التكوي&ن

source: Import &NVDA parameters (normal configuration)
ar: استيراد & معلمات NVDA (التكوين العادي)

source: Import all the &configuration
ar: استيراد كافة ال&تكوين

source: Import terminated
ar: تم إنهاء الاستيراد

source: No addon to import
ar: لا يوجد ملحق للاستيراد

source: %s add-on exists. Do you want to replace it?
ar: الوظيفة الإضافية %s موجودة. هل تريد استبدالها؟

source: No profile to import
ar: لا يوجد ملف تعريف للإستيراد

source: No speech dictionary to import
ar: لا يوجد قاموس للنطق للإستيراد

source: The configuration folder contains already speech dictionaries. Do you want to replace them?
ar: يحتوي مجلد التكوين بالفعل على قواميس الكلام. هل تريد استبدالهم؟

source: No ponctuation or symbol pronunciations to import
ar: لا يوجد ترقيم أو نطق الرموز للإستيراد

source: The configuration folder already contains symbol/punctuation pronunciations. Do you want to replace it?
ar: يحتوي مجلد التكوين بالفعل على طرق نطق الرموز / علامات الترقيم. هل تريد استبدالها؟

source: No input gesture change to import
ar: لا يوجد تغيير في إيماءة الإدخال للإستيراد

source: The configuration folder already contains input gesture changes. Do you want to replace them?
ar: يحتوي مجلد التكوين بالفعل على تغييرات إيماءات الإدخال. هل تريد استبدالهم؟

source: No NVDA normal configuration to import
ar: لا يوجد تكوين عادي ل NVDA للاستيراد

source: The configuration folder already contains NVDA normal configuration. Do you want to replace it?
ar: مجلد التكوين يحتوي بالفعل على إعدادات NVDA العادية. هل تريد استبدالها؟

source: The "%s" folder contains data that will be erased during copying. Do you still wish to continue?
ar: يحتوي المجلد " %s" على البيانات التي سيتم مسحها أثناء النسخ. هل مازلت ترغب في الاستمرار؟

source: Modification of %s folder
ar: تعديل مجلد %s

source: Addons's import
ar: استيراد الإضافات

source: &Add-ons:
ar: الإ&ضافات:

source: Check &all
ar: &تحديد الكل

source: &Delete existing add-ons
ar: &حذف الوظائف الإضافية الحالية

source: &Import
ar: إ&ستيراد

source: all items are checked
ar: يتم فحص جميع العناصر

source: all items are unchecked
ar: لم يتم التحقق من جميع العناصر

source: Do you really want to delete all add-ons of %s folder?
ar: هل تريد حقًا حذف كافة الوظائف الإضافية لمجلد %s؟

source: confirmation
ar: التأكيد

source: there is no add-on checked
ar: لا توجد وظيفة إضافية تم فحصها

source: Adding new folder
ar: إضافة مجلد جديد

source: folder's userName:
ar: اسم المستخدم للمجلدات

source: folder's &location:
ar: موقع المجلد&

source: &Browse...
ar: إ&ستعراض

source: &Add
ar: إ&ضافة

source: Folder's selection
ar: اختيار المجلد

source: you must specify the username of the folder
ar: يجب عليك تحديد اسم مستخدم للمجلد

source: You must specify the path to the location of the configuration
ar: يجب عليك تحديد موقع مسار التكوين

source: The folder with "%s" username is already in the list of configuration folders
ar: المجلد الذي يحمل اسم المستخدم " %s" موجود بالفعل في قائمة مجلدات التكوين

source: choose another username
ar: إختار إسم آخر

source: The "%s" folder already exists and it's a nvda configuration folder. Do you want to add it anyway?
ar: المجلد " %s" موجود بالفعل وهو مجلد تكوين nvda. هل تريد إضافته على أي حال؟

source: The "%s" folder already exists and it's not a nvda configuration folder. Do you want to add it anyway?
ar: المجلد " %s" موجود بالفعل وهو ليس مجلد تكوين nvda. هل تريد إضافته على أي حال؟

source: Adding existing folder
ar: إضافة مجلد موجود

source: folder's &path:
ar: & مسار المجلد:

source: The folder is not user configuration's folder
ar: المجلد ليس مجلد تكوين المستخدم

source: Configuration profiles's import
ar: استيراد ملفات تعريف التكوين

source: &Profiles:
ar: ال&ملف الشخصي

source: &Delete existing profiles
ar: &حذف الملفات الشخصية الموجودة

source: Do you really want to delete all profiles of %s folder?
ar: هل تريد حقًا حذف كافة ملفات التعريف لمجلد %s؟

source: There is no profile checked
ar: لا يوجد ملف تعريف للتحديد

source: %s profile exists. Do you want to replace it?
ar: ملف تعريف %s موجود. هل تريد استبدالها؟

source: Impossible to import profils
ar: لا يمكن إستيراد الإعدات والسمات لملف التعريف

source: The configuration file of the add-on contains errors. The part of the configuration concerning the global parameters has been reset to factory defaults
ar: يحتوي ملف التكوين الخاص بالوظيفة الإضافية على أخطاء. تم إعادة تعيين جزء التكوين المتعلق بالمعلمات العالمية إلى إعدادات المصنع الافتراضية

source: The old configuration file of "%s" add-on contains errors. It's not possible to keep previous configuration
ar: يحتوي ملف التكوين القديم للوظيفة الإضافية " %s" على أخطاء. لا يمكن الاحتفاظ بالتكوين السابق

source: The add-on configuration will be reset to factory values and NVDA will be restarted. Would you like to continue?
ar: ستتم إعادة ضبط إعدادات الوظيفة الإضافية على قيم المصنع وإعادة تشغيل NVDA. هل ترغب في الاستمرار؟

source: Configuration reset
ar: إعادة ضبط الإعدادات

source: Records:
ar: المحفوظات

source: The current configuration of the "Voice profile switching"feature is not compatible with this add-on's version, All selectors have been released and the voice profiles deleted. Sorry for the inconvenience.
ar: التكوين الحالي لميزة "تبديل ملف التعريف الصوتي" غير متوافق مع إصدار هذه الوحدة، تم تحديد جميع المحددات وحذف ملفات التعريف الصوتية. نعتذر على الإزعاج.

source: warning
ar: تحذير

source: Impossible, the synthesizer of voice profile {voiceProfileName} associated to selector {selector} is not available. Do you want to free this selector?
ar: يستحيل ، مُركِّب ملف تعريف الصوت {voiceProfileName} المرتبط بالمحدد {selector} غير متاح. هل تريد تحرير هذا المحدد؟

source: Synthesizer error
ar: خطأ في آلة النطق

source: Selector {selector}: {name}
ar: التعريف رقم {selector}:والصوت هو {name}

source: no other selector set to voice profile
ar: لم يتم تعريف أي صوت آخر

source: no selector set to voice profile
ar: لم يتم تعريف أي صوت

source: yes
ar: نعم

source: no
ar: لا

source: {name} voice profile set to selector {selector}
ar: الصوت هو: {name} والمعرف هورقم: {selector}

source: all selectors are freed from their vocal profile
ar: جميع المعرفات تم إعادتها إلى الإفتراضي وأصبحت بدون أي صوت

source: Automatic language switching (when supported)
ar: التبديل بين اللغة تلقائيا عند دعم ذلك

source: Automatic dialect switching (when supported)
ar: تبديل تلقائي للهجات عند دعم ذلك

source: Punctuation/symbol level
ar: مستوى رموز/ علامات الترقيم

source: Trust voice's language when processing characters and symbols
ar: الإعتماد على لغة المصدر عند معالجة الحروف والرموز

source: Include Unicode Consortium data (including emoji) when processing characters and symbols
ar: تضمين بيانات Unicode Consortium (بما في ذلك الرموز التعبيرية) عند معالجة الأحرف والرموز

source: Capital pitch change percentage
ar: نسبة التغيير عند نطق الحروف الكبيرة

source: Say cap before capitals
ar: نطق cap قبل الحروف الكبيرة

source: Beep for capitals
ar: صفير للحروف الكبيرة

source: Use spelling functionality if supported
ar: إستخدام خاصية تصحيح الهجاء إن كانت مدعمة

source: selector: %s
ar: الإختيار~: %s

source: Voice profile name: %s
ar: إسم ملف تعريف الصوت: %s

source: Associated under %s configuration profile
ar: مرتبط بملف مواصفات التكوين %s

source: Synthesizer: %s
ar: ألة النطق: %s

source: Output device: %s
ar: جهاز الإخراج: %s

source: Voice profile selectors's Management of profile %s
ar: إدارة محددات ملف تعريف الصوت لملف التعريف %s

source: &Selectors
ar: الم&حدد

source: free
ar: فارغ

source: &Use selectors associated under normal cconfiguration's profile
ar: ا&ستخدم المحددات المرتبطة بملف تعريف التكوين العادي

source: &Activate voice profile
ar: تن&شيط الملف الصوتي

source: A&ssociate voice profile
ar: إ&ضافة تعريف صوتي

source: &Modify voice profile
ar: ت&عديل الملف الصوتي

source: &Free selector
ar: &مسح المعرف المحدد

source: &Free all selectors
ar: م&سح كل المعرفات

source: Voice profile's &informations
ar: م&علومات ملف تعريف الصوت

source: Voice profile 's informations
ar: معلومات الملف, الصوتي

source: Selector {selector} is already set to {voiceProfileName} voice profile. Do you want to replace this voice profile?
ar: تعريف {selector} معرف بالفعل {voiceProfileName} هل تريد إستبداله؟

source: Do you really want to free selector {selector} associated to the voice profile "{voiceProfileName}"?
ar: هل تريد حقًا تحرير المحدِّد {selector} المرتبط بملف تعريف الصوت "{voiceProfileName}"؟

source: Do you really want to free all selectors set to this configuration profile?
ar: هل تريد حقًا تحرير كافة المحددات المعينة لملف تعريف التكوين هذا؟

source: Modify voice profile
ar: تعديل الملف الصوتي

source: voice profile name:
ar: إسم ملف تعريف الصوت:

source: &Default
ar: الا&فتراضي

source: You must set the name of voice profile
ar: يجب عليك تعين إسم للملف الصوتي

source: Voice profile association
ar: الملف الصوتي الشخصي

source: System tray icons 's list
ar: قائمة رموز علبة النظام

source: &Icons
ar: الرمو&ز

source: &Right click
ar: نقرة &يمين

source: &Left click
ar: نقرة ي&سرى

source: Dou&ble left click
ar: انقر مرتين على الي&سار

source: color
ar: اللون

source: background color
ar: لون الخلفية

source: unexpected space
ar: مساحة غير متوقعة

source: missing space
ar: مساحة مفقودة

source: missing uppercase
ar: الأحرف الكبيرة مفقودة

source: inversed uppercase
ar: أحرف كبيرة مقلوبة

source: unexpected %s
ar: %s غير متوقع

source: multiple contigous spaces
ar: مسافات متجاورة متعددة

source: tab at end
ar: علامة التبويب في النهاية

source: space at end
ar: المسافة في النهاية

source: change in %s
ar: التغيير في %s

source: At {pos}: {anomaly}
ar: في{pos}: {anomaly}

source: %s analyzis's detections
ar: %sاكتشافات التحليل

source: Error: buildVars.py file is not found
ar: خطأ: لم يتم العثور على ملف buildVars.py

source: error
ar: خطأ

source: Cannot get add-on translated manifest of %s language
ar: لا يمكن الحصول على بيان مترجم للوظيفة الإضافية للغة %s

source: Creation of HTML documentation files
ar: إنشاء ملفات مساعدة HTML

source: No documentation file to convert
ar: لا يوجد ملف مساعدة للتحويل

source: No file converted
ar: لم يتم تحويل الملف

source: %s files converted
ar: تم تحويل الملفات %s

source: Creation of manifest.ini file
ar: إنشاء ملف manifest.ini

source: The manifest.ini file already exists. Do you really want to update it?
ar: ملف manifest.ini موجود بالفعل. هل تريد حقا تحديثه؟

source: manifest.ini file has been updated
ar: تم تحديث ملف manifest.ini

source: Creation of localization manifest.ini file
ar: إنشاء ملف manifest.ini للترجمة

source: No language for this add-on
ar: لا توجد لغة لهذه الوظيفة الإضافية

source: Error: %s file is not found
ar: خطأ: لم يتم العثور على ملف %s

source: Some translation strings are missing for "%s" language
ar: بعض السلاسل مفقودة للغة %s

source: %s localization manifest.ini files created
ar: تم إنشاء ملفات manifest.ini الخاصة بالترجمة %s

source: No localization manifest.ini file created
ar: لم يتم إنشاء ملف manifest.ini للغة

source: Creation of POT file of %s add-on
ar: إنشاء ملف POT لإضافة %s

source: %s file created
ar: تم إنشاء الملف %s

source: Impossible to create POT file: no source file defined in buildVars.py
ar: من المستحيل إنشاء ملف POT: لا يوجد ملف مصدر معرف في buildVars.py

source: Impossible to create POT file
ar: عدم إمكانية إنشاء ملف pot

source: Prepare %s add-on
ar: جاري التحضير للإضافة %s

source: Prepare add-on start
ar: البدء بإعداد الإضافة

source: Manifest.ini file updated
ar: تم تحديث ملف Manifest.ini

source: %s localization manifest.ini files created or updated
ar: تم إنشاء أو تحديث ملفات %s locale manifest.ini

source: But for these languages, some strings are not translated: %s
ar: لكن بالنسبة لهذه اللغات ، لم تتم ترجمة بعض السلاسل: %s

source: one file converted
ar: ملف واحد تم تحويله

source: %s HTML files created
ar: تم إنشاء ملفات HTML %s

source: {count} poFiles compiled on {nb}
ar: {count} تم تجميعملفات po على {nb}

source: Add-on bundle could not be created
ar: لا يمكن إنشاء حزمة الوظيفة الإضافية

source: The {name} file has been created and recorded in {dir} folder
ar: تم إنشاء ملف {name} وتسجيله في مجلد {dir}

source: Completed
ar: إكتملت

source: Creation of buildVars.py file
ar: إنشاء ملف buildVars.py

source: Warning: buildVars.py already exists. Do you want to replace it?
ar: تحذير: buildVars.py موجود بالفعل. هل تريد استبدالها؟

source: buildVars.py file created
ar: إنشاء ملف buildVars.py

source: Tools for add-on development
ar: أدوات لتطوير الإضافات

source: Update add-on &version
ar: ت&حديث إصدار الوظيفة الإضافية

source: &Update manifest.ini file
ar: تحديث ملف &manifest.ini

source: Create P&OT file
ar: إنشاء ملف PO&T

source: &Prepare addon
ar: &قم بتحضير الملحق

source: &Languages:
ar: الل&غات:

source: Create &localization manifest.ini file
ar: إنشاء ملف &manifest.ini للإعدادات المحلية

source: Create &HTML documentation files
ar: إنشاء ملفات مساعدة &HTML

source: Create &buildVars file
ar: إن&شاء ملف buildVars

source: &Explore add-on folder
ar: م&ستكشف مجلد الوظيفة الإضافية

source: All
ar: كل

source: Update add-on version
ar: تحديث إصدار الوظيفة الإضافية:

source: Error: buildVars.py file has no add-on version line
ar: خطأ: ملف buildVars.py لا يحتوي على سطر إصدار الإضافة

source: Version of buildVars.py file has been updated
ar: تم تحديث إصدار ملف buildVars.py:

source: Entry add-on version:
ar: أدخل إصدار الإضافة:

source: No add-on installed
ar: لا -توجد إضافات مثبته

source: The update is not compatible with this version of NVDA. Minimum NVDA version: {minYear}.{minMajor}, last tested: {testedYear}.{testedMajor}.
ar: التحديث غير متوافق مع هذا الإصدار من NVDA. Minimum إصدار NVDA:{minYear}.{minMajor}, آخر اختبار: {testedYear}.{testedMajor}.

source: Downloading {name}
ar: تنزيل {name}

source: Error downloading update for {name}.
ar: حدث خطأ أثناء تنزيل التحديث لـ {name}.

source: Cannot update {name} - missing file or invalid file format
ar: لا يمكن تحديث {name} - ملف مفقود أو تنسيق ملف غير صالح

source: Updating
ar: تحديث

source: Please wait while the add-on is being updated.
ar: الرجاء الانتظار حتى يتم تحديث الوظيفة الإضافية.

source: Failed to update {name} add-on
ar: أخفق تحديث الوظيفة الإضافية {name}

source: {summary} - update
ar: {summary} - التحديث

source: The service is temporarily under maintenance. Please, try again later.
ar: الخدمة قيد الصيانة مؤقتًا. الرجاء معاودة المحاولة في وقت لاحق.

source: New version%s is available. Do you want to download it now?
ar: يتوفر إصدار جديد %s. هل تريد التحميل الآن؟

source: You are up-to-date. %s is the latest version.
ar: إصدار %s . هو أحدث إصدار حتى الآن.

source: Oops! There was a problem checking for updates. Please retry later
ar: يا الله! حدثت مشكلة في التحقق من وجود تحديثات. الرجاء إعادة المحاولة لاحقًا

source: &Yes
ar: &نعم

source: &No
ar: &لا

source: &Later
ar: لا &حقا

source: Wha&t's new
ar: ما هو ا&لجديد

source: User input Gestures
ar: إيماءات إدخلها المستخدم

source: Remove &all
ar: إزالة ال&كل

source: {main} ({source})
ar: الرئيسي {main} والمصدر ({source})

source: Do you really want to erase all the modifications of input gesture that have been made?
ar: هل تريد حقًا محو جميع التعديلات التي تم إجراؤها على إيماءة الإدخال؟

source: Deleted gestures
ar: حذف الإختصارات

source: No help available here.
ar: لا توجد مساعدة متاحة هنا.

source: No user guide found.
ar: لم يتم العثور على دليل مستخدم.

source: Informations
ar: المعلومات

source: Co&py to Clipboard
ar: ن&سخ الى الحافظة

source: Copied
ar: تم النسخ

source: Error, the information cannot be copied to the clipboard
ar: خطأ لا يمكن نسخ المعلومات الى الحافظة

source: Warning: Numeric lock is activated
ar: تحذير: تم تنشيط القفل الرقمي

source: interrupted
ar: متقطع

source: "%s" dialog is already open
ar: مربع الحوار "%s" مفتوح بالفعل

source: List, list's item
ar: قائمة, عرض القائمة

source: Tab
ar: تبويب

source: table item
ar: عنصر الجدول

source: menu item
ar: عنصر القائمة

source: list of visible items making up the object in the foreground
ar: قائمة من العناصر المرئية التي تشكل الكائن في المقدمة

source: Ignore untagged items
ar: تجاهل العناصر غير المميزة

source: &Type:
ar: &النوع:

source: Elements:
ar: العناصر:

source: Move &navigator object to it
ar: ن&قل الحركة الى الكائن

source: Elements's searching
ar: عناصر البحث
