Repository: Ishtef/NVDAExtensionGlobalPlugin
Catalog: addon/locale/*/LC_MESSAGES/nvda.po
Languages: ar

source: Not available on this operating's system
ar: لا تتوفر هذه الخدمة على نظام التشغيل هذا

source: The main volume and that of NVDA are established and their level sets to the one in the configuration
ar: تم ضبط مستوى الصوت الرئيسي وكل الأصوات الأخرى بما فيها nvda الى مستوى واحد

source: Keyboard Keys's renaming
ar: إعادة تسمية مفاتيح لوحة المفاتيح

source: NVDA defined key labels:
ar: تسميات المفاتيح الرئيسيةل nvda

source: Modified label:
ar: تعديل التسمية:

source: &Modify
ar: &تعديل

source: &Remove
ar: إ&زالة

source: R&emove all
ar: حذف ال&كل

source: Redefined in %s
ar: تم إعادة التعيين الى %s

source: Enter new label:
ar: أدخل تسمية جديدة:

source: Key label redifinition
ar: تسمية المفاتيح وإعادة البيانات

source: New name is removed
ar: تمت إزالة الإسم الجديد

source: No modification
ar: أي تعديل

source: All replacement labels have been removed
ar: تمت إزالة جميع التسميات البديلة

source: End duration in %s minutes
ar: باقي على نهاية المدة %sدقائق؟

source: End duration in one minute
ar: مدة الانتهاء في دقيقة واحدة

source: End of minutetimer
ar: نهاية الموقت

source: Launch of the Minute timer
ar: تشغيل مؤقت الدقائق

source: Enter the minute timer &duration (in minutes):
ar: أد&خِلْ المدة للمؤقت وهي بالدقائق

source: Enter the &announce to be spoken at the end of duration:
ar: أد&خل أإعلان ليتم نطقه في نهاية المدة:

source: Delay to be alerted before ending (in minutes):
ar: مدة التأخير ليتم تنبيهك قبل الانتهاء (بالدقائق):

source: Ring's &Options
ar: &خيارات الرنين

source: Duration is not valid
ar: مدة غير صالحه

source: The Delay to be notified before duration ending must be smaller than duration
ar: تأخير الإعلام لابد أن يكون أقل من:

source: Minute timer started for %s minutes
ar: بدأ العد التنازلي للمؤقت سيبدأ من %s دقائق

source: Ring options
ar: خيارات الرنين

source: &Number of rings:
ar: &عدد الرنات

source: &Delay between rings (in milliseconds):
ar: التأخير بين ال&حلقات (بالملي ثانية):

source: Current minute timer
ar: مؤقت الوقت الحالي

source: Remaining duration:
ar: المدة المتبقية هي :

source: &Stop
ar: إي&قاف

source: Minute timer is stopped
ar: تم إيقاف المؤقت

source: %s seconds
ar: %s ثانية

source: {minutes} minutes {seconds}
ar: {minutes} دقائق {seconds} ثواني

source: NVDA logs management
ar: إدارة السجل

source: Open &current log
ar: &فتح السجل الحالي

source: Open &previous log
ar: فتح ال&سجل السابق

source: Copy current log file &path to clipboard
ar: نس&خ ملف السجل الحالي و المسار إلى الحافظة

source: Copy &old log file path to clipboard
ar: &نسخ مسار ملف السجل القديم إلى الحافظة

source: Open Error
ar: خطأ في الفتح

source: old log file path copied to clipboard
ar: تم نسخ مسار ملف السجل القديم إلى الحافظة

source: old log file path cannot be copied to clipboard
ar: لا يمكن نسخ مسار ملف السجل القديم إلى الحافظة

source: %s dialog is allready open
ar: %s مربع الحوار هذا مفتوح بالفعل

source: Font:
ar: الخط:

source: Family: %s
ar: العائلة: %s

source: Name: %s
ar: الاسم: %s

source: Size: %s
ar: الحجم: %s

source: Text's alignment: %s
ar: محازاة النص: %s

source: Attributes: %s
ar: سمات: %s

source: Vertical alignment: %s
ar: محاذاة عمودية: %s

source: Position: %s
ar: الموضع: %s

source: Paragraph's indentation: %s
ar: المسافة البادئة للفقرة: %s

source: style: %s
ar: نمط: %s

source: Line spacing: %s
ar: تباعد الأسطر: %s

source: Indentation: %s
ar: المسافة البادئة: %s

source: Formatting's Informations
ar: معلومات التنسيق

source: Voice profile switching
ar: تحويل ملف التعريف الصوتي

source: Display the running application windows's list with opportunity to put one of them on the foreground or destroy it
ar: عرض قائمة لنوافذ التطبيقات قيد التشغيل مع إمكانية وضع واحد منهم على المقدمة أو إغلاقها

source: Shows the list of buttons on the System Tray
ar: عرض قائمة الأزرار الموجودة في صينية النظام

source: Set the volume of current focused application to %s percent of speakers volume
ar: ضبط حجم التطبيق المركز الحالي على %s بالمائة من حجم مكبرات الصوت

source: Set the NVDA volume to %s percent of speakers volume
ar: ضبط مستوى صوت NVDA على %s بالمائة من حجم مكبرات الصوت

source: Display the dialog to shutdown, reboot or hibernate the computer
ar: اعرض مربع الحوار لإيقاف تشغيل الكمبيوتر أو إعادة تشغيله أو إسباته

source: Shutdown the computer
ar: إيقاف تشغيل الكمبيوتر

source: Reboot the computer
ar: إعادة تشغيل الكمبيوتر

source: Hibernate the computer
ar: وضع الإثبات للكمبيوتر

source: Allow you to copy or type complex symbol
ar: يسمح لك بنسخ أو كتابة رمز معقد

source: Display the list of last used complex symbols
ar: اعرض قائمة بآخر الرموز المعقدة المستخدمة

source: Display the list's visible items making up current foreground object
ar: عرض قائمة بالكائنات لعناصر النافذة الحالية

source: If pressed twice: display the list's visible items making up it
ar: إذا تم الضغط مرتين: قم بعرض العناصر المرئية, الخاصة بالقائمة

source: {systrayIconsDoc}. Twice, {activeWindowsDoc}
ar: {systrayIconsDoc}. مرتين, {activeWindowsDoc}

source: Report the application 's name and version. Twice: copy these informations to clipboard
ar: الإبلاغ عن اسم التطبيق والإصدار. مرتين: نسخ هذه المعلومات إلى الحافظة

source: Speaks the filename of the active application along with the name of the currently loaded appModule python file. Pressing this key twice,speak the name and state of the current configuration profile
ar: يعلن عن إسم التطبيق النشط إلى جانب اسم الإضافة المحمل حاليًا. اضغط على المفتاح مرتين ، يعلن عن إسم وحالة ملف التعريف الحالي

source: Report the name and version number of add-on activated for focused application
ar: الإعلان عن اسم الإضافة- وإصدارها للنافذة النشطة

source: Display informations about the focused application
ar: عرض معلومات حول التركيز الحالي

source: Display dialog to start the minute timer. If minute timer already started, display dialog to report duration
ar: عرض مربع الحوار لبدء عداد الدقائق. إذا بدأ مؤقت الدقائق بالفعل ، اعرض مربع الحوار لتقرير المدة

source: Display add-on user's guide
ar: عرض دليل المستخدم

source: Display the list of commands of the commands interpreter
ar: اعرض قائمة أوامر مترجم الأوامر

source: Open a dialog to manage NVDA logs
ar: فتح مربع حوار إدارة السجل

source: Open current NVDA log file. Pressing this key twice, open the old NVDA log file. Pressing third, copy current log path to the clipboard
ar: فتح السجل الحالي. الضغط مرتين ، فتح ملف السجل NVDA القديم. الضغط الثالث ، نسخ مسار السجل الحالي إلى الحافظة

source: report the name of current selected folder in the open or Save dialog box. Twice: report full path
ar: الإعلان عن اسم المجلد المحدد الحالي في مربع الحوار فتح أو حفظ. مرتين: الإبلاغ عن المسار الكامل

source: report the name of current selected folder in the open or Save dialog box
ar: الإعلان عن اسم المجلد المحدد الحالي في مربع الحوار فتح أو حفظ

source: report the full path of current selected folder in the open or Save dialog box
ar: الإعلان عن المسار الكامل للمجلد المحدد الحالي في مربع الحوار فتح أو حفظ

source: Explore my user configuration's folder
ar: استكشف مجلد تكوين المستخدم الخاص بي

source: Explore NVDA program's folder
ar: اكتشف مجلد برنامج NVDA

source: Display speech history records
ar: عرض السجل لمحفوظات الكلام

source: Report previous record of the speech history and copy it to clipboard
ar: الإعلان عن سجِل النطق السابق ونسخه الى الحافظة

source: Report current record of the speech history and copy it to clipboard. Twice: display speech history
ar: الإعلان عن السجل الحالي لمحفوظات الكلام وانسخه إلى الحافظة. مرتين: عرض محفوظات الكلام

source: Report next record of the speech history and copy it to clipboard
ar: الإعلان عن السجل التالي لمحفوظات الكلام وانسخه إلى الحافظة

source: Restart NVDA. Twice: restart with log level set to debug
ar: أعد تشغيل NVDA. مرتين: إعادة التشغيل مع ضبط مستوى السجل على التصحيح

source: Toggle voice profile switch mode
ar: تبديل وضع تبديل الصوت

source: Display dialog to manage voice profile selectors
ar: عرض مربع حوار لإدارة التعريف الصوتي

source: Go backward to the first selector associated to a voice profile and set this voice profile as current voice profile
ar: الإنتقال الى الصوت السابق وجعله الصوت الحالي

source: Go to forward to the first selector associated to a voice profile and set this voice profile as current voice profile
ar: الإنتقال الى الصوت التالي وجعله الصوت الحالي

source: Display keyboard keys renaming dialog
ar: عرض حوار إعادة تسمية مفاتيح لوحة المفاتيح

source: Display command key selective announcement dialog
ar: عرض قائمة للإعلان عن نطق أزرار لوحة المفاتيح

source: Report the current time. Twice: report the current date. Third: copy date and time to the clipboard
ar: تقرير الوقت الحالي. مرتين: قم بالإبلاغ عن التاريخ الحالي. ثلاث مرات: نسخ التاريخ والوقت إلى الحافظة

source: Copy date and time to the clipboard
ar: نسخ التاريخ والوقت الى الحافظة

source: Display, in dialog box, formatting informations for the current review cursor position within a document
ar: عرض ، في مربع الحوار ، تنسيق المعلومات لموضع مؤشر الاستعراض الحالي داخل المستند

source: Launch commands's interpreter of add-on
ar: تشغيل وضع الطبقات للإضافة

source: Set selector 1 as current selector and set, if possible, its associated voice profile as current voice profile
ar: قم بتعيين المحدد 1 كمحدد حالي واضبط ، إن أمكن ، ملف تعريف الصوت المرتبط به كملف تعريف صوتي حالي

source: Set selector 2 as current selector and set, if possible, its associated voice profile as current voice profile
ar: قم بتعيين المحدد 2 كمحدد حالي واضبط ، إن أمكن ، ملف تعريف الصوت المرتبط به كملف تعريف صوتي حالي

source: Set selector 3 as current selector and set, if possible, its associated voice profile as current voice profile
ar: قم بتعيين المحدد 3 كمحدد حالي واضبط ، إن أمكن ، ملف تعريف الصوت المرتبط به كملف تعريف صوتي حالي

source: Set selector 4 as current selector and set, if possible, its associated voice profile as current voice profile
ar: قم بتعيين المحدد 4 كمحدد حالي واضبط ، إن أمكن ، ملف تعريف الصوت المرتبط به كملف تعريف صوتي حالي

source: Set selector 5 as current selector and set, if possible, its associated voice profile as current voice profile
ar: قم بتعيين المحدد 5 كمحدد حالي واضبط ، إن أمكن ، ملف تعريف الصوت المرتبط به كملف تعريف صوتي حالي

source: Set selector 6 as current selector and set, if possible, its associated voice profile as current voice profile
ar: قم بتعيين المحدد 6 كمحدد حالي واضبط ، إن أمكن ، ملف تعريف الصوت المرتبط به كملف تعريف صوتي حالي

source: Set selector 7 as current selector and set, if possible, its associated voice profile as current voice profile
ar: قم بتعيين المحدد 7 كمحدد حالي واضبط ، إن أمكن ، ملف تعريف الصوت المرتبط به كملف تعريف صوتي حالي

source: Set selector 8 as current selector and set, if possible, its associated voice profile as current voice profile
ar: قم بتعيين المحدد 8 كمحدد حالي واضبط ، إن أمكن ، ملف تعريف الصوت المرتبط به كملف تعريف صوتي حالي

source: Displays the dialog to manage the input gestures configured by user
ar: عرض مربع حوار بالإختصارات التي تمت بواسطة المستخدم

source: Display tools for add-on development dialog
ar: عرض مربع حوار تطوير الإضافات

source: Click the left mouse button at navigator object position. Twice: click twice this button at this position
ar: انقر فوق زر الماوس الأيسر في موضع كائن التنقل. مرتين: انقر مرتين على هذا الزر في هذا الموضع

source: Click the right mouse button at navigator object position. Twice: click twice this button at this position
ar: انقر بزر الفأرة الأيمن في موضع كائن الحركة. مرتين: انقر مرتين على هذا الزر في هذا الموضع

source: Display add-on settings dialog
ar: عرض مربع حوار إعدادات الإضافة

source: Display settings dialog for current configuration profile
ar: عرض مربع حوار الإعدادات لملف تعريف التكوين الحالي

source: Enable or disable the standard use of numeric keypad
ar: تمكين أو تعطيل الاستخدام القياسي للوحة المفاتيح الرقمية

source: Close all opened windows
ar: أغلق جميع النوافذ المفتوحة

source: Display running add-ons list
ar: عرض قائمة الوظائف الإضافية قيد التشغيل

source: Report current speech settings. Twice: display them
ar: الإعلان عن إعدادات الكلام الحالية. مرتين: اعرضهم

source: Report current speech settings
ar: الإعلان عن إعدادات الكلام الحالية

source: Display current speech settings
ar: عرض لإعدادات النطق الحالية

source: activate or desactivate text analyzer
ar: تنشيط أو إلغاء تنشيط محلل النص

source: Analyze the word under system cursor
ar: تحليل الكلمة تحت مؤشر النظام

source: Analyze the line under system cursor
ar: تحليل السطر تحت مؤشر النظام

source: Analyze the sentence under system cursor
ar: تحليل الجملة تحت مؤشر النظام

source: Analyze the paragraph under system cursor
ar: تحليل الفقرة تحت مؤشر النظام

source: Display the dialog to manage user configurations
ar: اعرض مربع الحوار لإدارة تكوينات المستخدم

source: Toggle reporting of current caret position in edit box
ar: تبديل الإبلاغ عن موضع علامة الإقحام الحالي في مربع التحرير

source: Add, to clipboard, the selected text
ar: إضافة النص المحدد إلى الحافظة

source: Empty the clipboard
ar: إفراغ الحافظة

source: Display the temporary audio device manager
ar: اعرض مدير جهاز الصوت المؤقت

source: Leave up the temporary audio device
ar: مغادرة جهاز الصوت المؤقت

source: Set, as temporary audio device, the next device in the list of checked devices of the temporary audio device manager
ar: قم بتعيين الجهاز التالي ، كجهاز صوت مؤقت ، في قائمة الأجهزة المحددة لمدير جهاز الصوت المؤقت

source: Set, as temporary audio output device , the next device in the list of devices selected in the temporary audio output device manager. Twice: leave up the temporary audio output device
ar: ضبط ، كجهاز إخراج صوتي مؤقت ، الجهاز التالي في قائمة الأجهزة المحددة في مدير جهاز إخراج الصوت المؤقت. مرتين: مغادرةجهاز إخراج الصوت المؤقت

source: Activate quick Addons Activation Dialog
ar: تشيط سريع لمربع حوار الإضافات النشطة

source: Set on main and NVDA volume
ar: تعين على القائمة الرئيسية وبرنامج nvda

source: Toggle current focused application volume mute
ar: التبديل بين كتم الصوت للتطبيق النشط

source: Increase volume of current focused application
ar: زيادة حجم الصوت للتطبيق الحالي

source: Decrease volume of current focused application
ar: خفض حجم الصوت للتطبيق الحالي

source: Maximize volume of current focused application
ar: الحد الأقصى لحجم الصوت للتطبيق الحالي

source: Minimize volume of current focused application
ar: الحد الأدنى لحجم صوت التطبيق الحالي

source: Set the volume of current focused application to previous level
ar: اضبط حجم التطبيق المركز الحالي على المستوى السابق

source: Increase NVDA volume
ar: زيادةحجم صوت NVDA

source: Decrease NVDA volume
ar: خفض حجم صوت nvda

source: Maximize NVDA volume
ar: الحد الأقصى لصوت nvda

source: Minimize NVDA volume
ar: الحد الأدنى لصوت nvda

source: Set the NVDA volume to previous level
ar: اضبط مستوى صوت NVDA على المستوى السابق

source: Increase volume of speakers
ar: زيادة حجم مستوى الصوت الرئيسي

source: Decrease volume of speakers
ar: خفض حجم مكبرات الصوت

source: Maximize volume of speakers
ar: الحد الأقصى للصوت الرئيسي

source: Minimize volume of speakers
ar: الحد الأدنى للصوت الرئيسي

source: Set the main volume to previous level
ar: اضبط مستوى الصوت الرئيسي على المستوى السابق

source: Hear NVDA to right and focused application to left
ar: استمع إلى NVDA إلى اليمين والتطبيق المركّز إلى اليسار

source: Hear NVDA to left and focused application to right
ar: استمع إلى NVDA من اليسار والتطبيق المركز من اليمين

source: Hear NVDA and focused application on center
ar: استمع إلى NVDA والتطبيق المركّز في المنتصف

source: Hear NVDA to right and all audio applications to left
ar: استمع إلى NVDA إلى اليمين وكل التطبيقات الصوتية إلى اليسار

source: Hear NVDA to left and all audio applications to right
ar: استمع إلى NVDA إلى اليسار وكل التطبيقات الصوتية إلى اليمين

source: Hear NVDA and all audio applications on center
ar: استمع إلى NVDA وجميع تطبيقات الصوت في المنتصف

source: Hear focused application on center
ar: الإستماع الى التطبيق المركز من المنتصف

source: Display NVDA and active Applications's audio manager
ar: عرض NVDA ومدير الصوت بالتطبيقات النشطة

source: It's time
ar: إنها , الآن

source: Beep
ar: نغمة

source: Sound
ar: صوت

source: Message
ar: رسالة

source: nothing
ar: لا شيئ

source: Some changes have been made. You must save the configuration and restart NVDA for these changes to take effect. Would you like to do it now?
ar: تم إجراء بعض التغييرات. يجب عليك حفظ التكوين وإعادة تشغيل NVDA حتى تصبح هذه التغييرات سارية المفعول. هل تريد أن تفعل ذلك الآن؟

source: Don't forget to save the configuration for the changes to take effect !
ar: لا تنسى حفظ التكوين لتصبح التغييرات نافذة المفعول!

source: Features's installation
ar: تثبيت الميزات

source: Do not install
ar: عدم التثبيت

source: Install
ar: تثبيت

source: Install without gesture
ar: التثبيت عن طريق الإختصارات

source: Display &systray icons and running application windows list:
ar: عرض رموز نظام التشغيل وقائمة نوافذ التطبيقات قيد التشغيل:

source: &Complex symbols edition help:
ar: الم&ساعدة في إصدار الرموز المعقدة:

source: &Focused application's informations:
ar: &معلومات التطبيق المركز الحالي:

source: &Extended Virtual Buffer:
ar: إ&ستعراض الجداول

source: C&lipboard command announcement:
ar: الإ&علان عن أوامر الحافظة

source: Anno&uncement of the preselected folder in "Open", "Save", "Save as" dialog boxes:
ar: إ&علان عن المجلد المحدد مسبقًا في مربعات الحوار "فتح" و "حفظ" و "حفظ باسم":

source: &NVDA's log Files:
ar: عارض ت&قرير برنامج nvda:

source: Speech &history:
ar: نُطق الر&سائل

source: &Keyboard keys renaming:
ar: إ&عادة تسمية مفاتيح لوحة المفاتيح:

source: C&ommand keys selective announcement:
ar: ن&طق المفاتيح:

source: Minute &timer:
ar: م&ؤقت الدقائق:

source: NVDA's &restart:
ar: أ&عادة تشغيل nvda:

source: Display visible items making up the foreground &object:
ar: &عرض الكائنات للعناصر المرئية الموجودة في الخلفية:

source: &Voice profile switching:
ar: &تبديل ملف تعريف الصوت:

source: Ke&ys's remanence:
ar: &ثبات المفاتيح:

source: Volu&me's control:
ar: الت&حكم في مستوى الصوت:

source: &audio split:
ar: &تقسيم الصوت:

source: &Development's tools:
ar: أ&دوات التطوير:

source: &Date and time - supplements:
ar: إ&ضافات للتاريخ والوقت

source: Text anal&ysis:
ar: ت&حليل النص:

source: Temporar&y audio device:
ar: &جهاز الصوت المؤقت:

source: NVDA enhancements
ar: تحسينات NVDA

source: Editing
ar: التحرير

source: &Report next word on deletion
ar: الإعلان عن &حذف الكلمة التالية

source: maximum number of last &used symbols recorded:
ar: الحد الأ&قصى للرموز المستخدمة الأخيرة:

source: Speech history
ar: نُطق الرسائل

source: &Number the records
ar: الإ&علان عن رقم الرسائل

source: &Display records in ascending order
ar: &عرض السجلات بترتيب تصاعدي

source: Browser
ar: المتصفح

source: &Browse in loop
ar: &تصفحفي حلقة

source: reporting spelling errors
ar: الإبلاغ عن الأخطاء الإملائية

source: Report &by:
ar: &الإبلاغ بواسطة:

source: Clipboard
ar: الحافظة

source: maximum number of reported characters:
ar: الحد الأقصى لعدد الأحرف المبلغ عنها:

source: No limit
ar: غير محدود

source: Computer
ar: الكمبيوتر

source: Windows
ar: ويندوز

source: &No object description in Windows ribbons
ar: لا يو&جد وصف كائن في أشرطة Windows

source: Automatically &maximize windows
ar: ت&كبير النافذة تلقائيا

source: Report &windows clock's time with seconds
ar: الإعلان عن ال&ثواني عند نطق الوقت

source: Main and NVDA volume
ar: حجم مستوى الصوت الرئيسي وحجم NVDA

source: Set on &volume at the loading of the add-on
ar: &ضبط مستوى الصوت عند تحميل الملحق

source: &Threshold of recovery of the volume:
ar: الحد الأ&قصى لإستعادة مستوى الصوت:

source: Recovery &level:
ar: م&ستوى الإستعادة

source: NVDA volume
ar: مستوى صوت nvda

source: T&hreshold of recovery of the volume:
ar: &محدد استرداد الحجم:

source: &Recovery level:
ar: مس&توى الإستعادة

source: Volume change
ar: تغيير مستوى الصوت

source: Ste&ps's size:
ar: &مقدار حجم التغيير:

source: R&eport volume changes
ar: الإ&علان عن حجم التغيير:

source: &Increase speakers volume if necessary
ar: &رفع مستوى الصوت إذا لزم الأمر

source: Temporary audio device
ar: جهاز الصوت المؤقت

source: Ask for confirmation
ar: اطلب التأكيد

source: ma&ximum waiting time for confirmation (in seconds):
ar: الحد الأ&قصى لوقت انتظار التأكيد (بالثواني):

source: advanced
ar: متقدم

source: For No NVDA's version
ar: لا يوجد إصدار لnvda

source: For Only the NVDA's snapshot versions
ar: فقط الإصدارات اليومية

source: Only until the next NVDA restart
ar: فقط حتى إعادة تشغيل nvda المرة التالية

source: For all NVDA's versions
ar: جميع إصدارات NVDA

source: &Play sound on logged errors:
ar: ت&شغيل الصوت عند حدوث الأخطاء:

source: &Title dialog with add-on name
ar: &عنوان مربع الحوار للوظيفة الإضافية

source: &Delay between repeat of same gesture:
ar: ال&تأخير بين تكرار نفس الإختصار

source: &Do not take account of the option called "Report object descriptions" during the display of the dialog box same as confirmation
ar: & لا تأخذ في الاعتبار الخيار المسمى "تقرير أوصاف الكائن" أثناء عرض مربع الحوار مثل التأكيد

source: Keyboard
ar: لوحة المفاتيح

source: Keys's remanence
ar: ثبات المفاتيح

source: &Only NVDA key in remanence
ar: تثبيت مفتاح &nvda فقط

source: Activate &remanence at NVDA's start
ar: &تفعيل ثبات المفاتيح مع بداية تشغيل NVDA

source: &Remanence's delay (in milliseconds):
ar: التأ&خير حتى المفتاح التالي (وهي بالملي ثانية):

source: Play &sound at the start of remanence
ar: تشغيل الصوت في بداية تفعيل ث&بات المفاتيح

source: Play sound at the &end of remanence
ar: &تشغيل الصوت في نهايةتفعيل ثبات المفاتيح

source: Special remanence for &Gmail.com
ar: تفعيل إختصارات بريد &Gmail.com

source: Numeric keypad
ar: لوحة الأرقام

source: &Allow the standard use of the numeric keypad
ar: & السماح بالاستخدام القياسي للوحة المفاتيح الرقمية

source: &Enable the standard use of the numeric keypad at NVDA's start
ar: &تمكين الاستخدام القياسي للوحة المفاتيح الرقمية في بداية NVDA

source: &Enable / disable numeric keypad's standard use with num lock key
ar: تمكين /أو تعطيل الاستخدام القياسي للوحة المفاتيح الرقمية مع مفتاح &num lock

source: Numeric lock
ar: قفل الأرقام

source: &Report ?he activated state at NVDA starting
ar: &إعلان؟ قم بتنشيط الحالة عند بدء تشغيل NVDA

source: Update
ar: تحديث

source: Automatically check for &updates
ar: ال&بحث عن التحديث تلقائيا

source: Update also release versions to &development versions
ar: &قم بالتحديث ألى إصدارات التطوير

source: &Check for update
ar: الب&حث عن التحديث

source: View &history
ar: &عرض السجل

source: Settings
ar: الإعدادات

source: Cursor's moving
ar: تحريك المؤشر

source: &Punctuation/symbol level on word movement:
ar: م&ستوى رموز /علامات الترقيم أثناء الحركة:

source: Current configuration profile's level
ar: مستوى ملف تعريف التكوين الحالي

source: Text used as a &separator between contents added to the clipboard.
ar: النص المستخدم كفاصل &بين المحتويات المضافة إلى الحافظة.

source: &Add text before clipboard datas
ar: إ&ضافة النص قبل بيانات الحافظة

source: Ask &confirmation before adding
ar: ال&سؤال والتأكيد قبل الإضافة

source: &On profile activation:
ar: &تنشيط الملف الشخصي:

source: Do nothing
ar: لا شيئ

source: Desactivate
ar: تعطيل

source: Activate
ar: تفعيل

source: Text analysis
ar: تحليل النص

source: &Activate text analyzer
ar: &تفعيل محلل النص

source: Activate text analyzer at add-on's &start
ar: &قم بتنشيط محلل النص عند بدء الإضافات

source: Symbols match
ar: تطابق الرموز

source: Report &discrepancies
ar: الإبلا&غ عن التناقضات

source: Anomalies
ar: شاذة

source: Report a&nomalies
ar: الإ&بلاغ عن الحالات الشاذه

source: &Verify:
ar: &التحقق:

source: &For symbols:
ar: & للرموز:

source: Formatting
ar: تنسيق

source: Report &changes
ar: الإبلاغ عن الت&غييرات

source: Ty&pe:
ar: &Cype:

source: Alert
ar: تنبيه:

source: Sounds:
ar: اصوات:

source: Frequency:
ar: تردد:

source: Length:
ar: طول:

source: Message:
ar: رسالة:

source: Profile settings's %s
ar: إعدادات ملف التعريف %s

source: Alert message
ar: رسالة تنبيه

source: Detections's number
ar: عدد الاكتشافات
