Repository: Ishtef/NVDAExtensionGlobalPlugin
Catalog: addon/locale/*/LC_MESSAGES/nvda.po
Languages: ar

source: NVDA global commands extension
ar: وظائف إضافية لnvda

source: This add-on has been developed with the participation of Daniel Poiraud. It adds to NVDA: 1- The features Some features can be enabled or disabled individually. * Display of the list of icons in the notification area, * Display of the windows list of running applications, * Help in the composition of a symbol that is complex such as, for example, an a e related, a symbol power of 2 and possibility to add its own categories and symbols, * Extension of the functionality of the virtual buffer for browsers Mozilla Firefox, Microsoft Internet Explorer, Microsoft Edge, and Google Chrome: * new commands for navigation mode (paragraph, division, anchor, main area, * new types of elements for the dialog box opened by "NVDA+F7" (radio button, paragraph, frame, check box, ...) with the announcement of the number of items found, * commands for the tables: announce the cells of a row /column, go to first/last cell in the row/current column, move the column/row preceding or following with announcement possible of the cells in that row/column, * announcement of the URL of the document, * navigate in loop, * Announcement of the function associated with editing commands style Copy, Paste, etc., * Announcement of the name of the folder pre-selected in the dialog boxes like "Open", "Save", "Save as", ..., * display of information on the focused application: * the name and version number of the application, * the current profile configuration, * the add-on loaded for the application, * NVDA logs tools: * Opening the previous or current log, * copy of the path of these in the clipboard. * history of voice speech, * renaming keyboard keys, * selective announcement of command keyboard keys, * simple countdown timer, * display of visible elements making up the object in the foreground, * fast switching of voice profile, * remanence of the modifier keys, * shutdown, reboot or hibernate the computer, * control the main or NVDA volume: * mute or unmute volume for the focused application, * establishment of the main Windows or NVDA volume at the start of add-on, * modification of main volume or audio stream's volume of focused application. * automatic recovery of the main volume and NVDA when the extension is loaded, * orientation of NVDA audio output, * Tools for development of add-on * supplements regarding the date and time: copy date and time to clipboard, report time with seconds * user configurations management and NVDA restarting with precise configuration, * text analyser, * announcement of the cursor position in the edit boxes, * temporary use of an audio output device without impacting the NVDA configuration, * quick add-ons activation / desactivation, 2- The options * remove the announcement from the description of the objects in the Windows ribbons, * proclaim the word focused when deleting a word (for NVDA versions lower than 2020.3), * automatically maximize the foreground window, * announce punctuations and symbols when moving by word in a document, * possibility of signaling spelling errors by a double beep or by a voice announcement instead of the sound emitted by NVDA. 3- The advanced options * report, with a sound, the registration of an error in the NVDA log also for the final versions and release candidate of NVDA, * Caption dialog title with the name of the add-on, * Do not take account of the option called Report object descriptions during the display of the dialog box style confirmation, * use numeric keypad's keys conventionally. 4- Various other elements * presentation formatting of the text in a dialog box, * sub-menus to explore the program folders or configuration, * script to quickly restart NVDA, * script to emulate the "Applications" key, * script to close all open windows, * possibility of executing scripts in the "Input gestures" dialog (for versions of NVDA greater than 2020.3), * automatic selection of the category in the dialog "Command gestures", * Selection of the last parameter used in the synthesizer parameter loop.
ar: تم تطوير هذا الملحق بمشاركة دانيال بوارو. وتضيف إلى نفدا: 1-الميزات يمكن تمكين بعض الوظائف أو تعطيلها بشكل فردي. * عرض قائمة من الرموز في منطقة الإعلام ، * عرض قائمة من تشغيل تطبيقات ويندوز، * المساعدة في إنشاء رمز معقد ، مثل ، على سبيل المثال ، المرتبطة بالحرف ه ، ودرجة الرمز 2 والقدرة على إضافة فئات والرموز الخاصة بك ، * توسيع وظائف الظاهري المخزن المؤقت \ لموزيلا فايرفوكس ، مايكروسوفت إنترنت إكسبلورر ، مايكروسوفت إيدج وجوجل كروم المتصفحات: * أوامر جديدة لوضع الملاحة (الفقرة ، القسم ، مرساة ، المنطقة الرئيسية ، * أنواع جديدة من العناصر لمربع الحوار فتح عن طريق الضغط على "نفدا+ف7" (زر الاختيار, فقرة, الإطار, مربع,...) مع الإعلان عن عدد العناصر التي تم العثور عليها ، * أوامر للجداول: \ إسقاط الصف / خلايا العمود ، انتقل إلى الصف الأول / الأخير / خلية العمود الحالي ، نقل العمود / سبق الصف أو متبوعا بإعلان محتمل للخلايا في هذا الصف / العمود ، * إعلان رابط الوثيقة، * الملاحة في حلقة، * إعلان وظيفة تتعلق تحرير الأوامر \ تستيل نسخ ، لصق ، الخ .، * إعلان اسم المجلد المحدد مسبقا في مربعات الحوار مثل "فتح"," حفظ"," حفظ باسم",...، * عرض معلومات حول التطبيق الهدف: * اسم التطبيق ورقم الإصدار، \ تي * تكوين الملف الحالي، * إضافة في تحميل ل التطبيق، * \ تنفدا يسجل أدوات: * فتح السجل السابق أو الحالي، * نسخ المسار لهم إلى الحافظة. * تاريخ الكلام الصوتي، * إعادة تسمية مفاتيح لوحة المفاتيح، * إعلان انتقائي من مفاتيح الأوامر لوحة المفاتيح، * بسيط للعد التنازلي، * عرض العناصر المرئية التي تشكل الكائن في المقدمة، * التبديل السريع لملف تعريف الصوت، * حفظ مفاتيح التعديل، * اغلاق, إعادة تشغيل أو تبديل الكمبيوتر إلى وضع السكون، * إدارة الرئيسية أو نفدا حجم: * إيقاف أو تشغيل وحدة التخزين لتطبيق الهدف ، \ن * تعيين حجم الرئيسي من ويندوز أو نفدا عند إطلاق الوظيفة الإضافية، * تغيير حجم الرئيسي أو حجم دفق الصوت من التطبيق الهدف. * الانتعاش التلقائي من المجلد الرئيسي و نفدا عند تحميل التمديد ، * نفدا اتجاه إخراج الصوت، * أدوات لتطوير إضافات * الإضافات المتعلقة التاريخ والوقت: انسخ التاريخ والوقت إلى الحافظة ، وحدد الوقت بالثواني * إدارة تكوينات المستخدم وإعادة تشغيل نفدا مع ضبط دقيق، * محلل النص، * معلنا موقف المؤشر في حقول تحرير، * استخدام مؤقت لجهاز إخراج الصوت دون تغيير التكوين نفدا، * التنشيط السريع / إلغاء تنشيط الوظائف الإضافية، 2-المعلمات * إزالة الإعلان من وصف الكائنات على أشرطة ويندوز ، * أعلن كلمة تركز عندما عند حذف كلمة (لإصدارات نفدا أقل من 2020.3) ، \ن * تلقائي توسيع المقدمة نافذة, * أعلن علامات الترقيم والرموز عند الانتقال من خلال كلمة في مستند ، * القدرة على الإشارة إلى الأخطاء الإملائية بصوت مزدوج أو إعلان صوتي بدلا من الصوت الذي تنتجه نفدا. 3-معلمات إضافية * تقرير مع الصوت حول تسجيل خطأ في مجلة نفدا أيضا للإصدارات النهائية والمرشحين للإفراج نفدا، * عنوان الحوار ويندوز اسمه إضافات، * تجاهل المعلمة تسمى الوصف تقرير الكائن أثناء مربع الحوار عرض تأكيد النمط، * استخدم مفاتيح لوحة المفاتيح الرقمية بالطريقة المعتادة. 4-عناصر أخرى مختلفة * تنسيق النص في مربع الحوار ، * القائمة الفرعية لعرض مجلدات البرنامج أو التكوين، * سيناريو لإعادة تشغيل سريع من نفدا، * سيناريو لمحاكاة مفتاح "التطبيق"، * سيناريو لإغلاق جميع النوافذ المفتوحة، * القدرة على تنفيذ مخطوطات في مربع الحوار إيماءات الإدخال (لإصدارات نفدا الأقدم من 2020.3) ، * الفئة التلقائية التحديد في مربع الحوار إيماءات الأوامر، * اختيار المعلمة الأخيرة المستخدمة في حلقة المعلمة المزج.

source: Do you want to keep previous add-on configuration settings?
ar: هل تريد الاحتفاظ بإعدادات تكوين الوظيفة الإضافية السابقة؟

source: %s - installation
ar: %s -التثبيت

source: Are you sure you don't want to keep the current add-on configuration settings?
ar: هل أنت متأكد من أنك لا تريد الاحتفاظ بإعدادات التكوين الإضافية الحالية?

source: Attention, you must uninstall "%s" add-on because it is now included in this add-on
ar: تنبيه ، يجب إلغاء تثبيت الوظيفة الإضافية "%s" لأنها مضمنة الآن في هذه الوظيفة الإضافية

source: (command: %s)
ar: (الإختصار: %s)

source: %s add-on configuration menu
ar: قائمة تكوين الإضافة %s

source: Global settings...
ar: الاعدادات العامة...

source: Current configuration profile settings...
ar: إعدادات ملف تعريف التكوين الحالي ...

source: Keyboard Keys renaming...
ar: إعادة تسمية المفاتيح...

source: Command keys selective announcement...
ar: نطق المفاتيح...

source: Reset configuration to default values
ar: إعادة ضبط الإعدادات لى القيم الافتراضية

source: Explore &NVDA
ar: استكشاف &NVDA

source: Menu to explore the NVDA program folder or the user configuration folder
ar: قائمة لاستكشاف مجلد برنامج NVDA أو مجلد إعدادات المستخدم

source: My &configuration's folder
ar: مجلد الإ&عدادات

source: NVDA &Program folder
ar: م&جلد برنامج nvda

source: Manage user configurations
ar: إدارة تكوين المستخدم

source: Please wait
ar: الرجاء الإنتظار

source: {0} copied to clipboard
ar: {0} تم النسخ إلى الحافظة

source: Configuration's profile {profileName} {state}
ar: تكوين الملف الشخصي ' {profileName} {state}

source: {0} version {1}
ar: {0} إصدار {1}

source: Product name and version has been copied to clipboard
ar: إسم الملحق وإصداره تم نسخه إلى الحافظة

source: add-on: {name}, version: {version}
ar: الإضافة: {name} ، الإصدار: {version}

source: No add-on
ar: لاتوجد إضافات

source: Configuration profile: {profileName} {state}
ar: تكوين الملف الشخصي: {profileName} {state}

source: Application: {appName} {appVersion}
ar: البرنامج هو: {appName} والإصدار {appVersion}

source: {summary}, version: {version}
ar: ملخص {summary}, الإصدار: {version}

source: Active add-on: %s
ar: الإضافة النشطة -هي: %s

source: add-on's path: %s
ar: مسار الوظيفة الإضافية:%s

source: Warning: it seems that others add-ons are installed and activated for this application
ar: تحذير: يبدو إن الإضافة تستخدم مع تطبيقات أخرى

source: Loaded python module: %s
ar: وحدة بايثون المحملة ل %s

source: Application context's informations
ar: معلومات سياق التطبيق

source: Current log file path copied to clipboard
ar: تم نسخ مسار ملف السجلالحالي الى الحافظة

source: Current log file path cannot be copied to clipboard
ar: لا يمكن نسخ مسار ملف السجل الحالي إلى الحافظة

source: Previous log file cannot be opened
ar: لا يمكن فتح ملف السجل السابق

source: Current log file cannot be opened
ar: لا يمكن فتح ملف السجل الحالي

source: File open Error
ar: خطأ في فتح الملف

source: Are you sure you want to shutdown immediately the computer ?
ar: هل أنت متأكد أنك تريد إيقاف تشغيل جهاز الكمبيوتر على الفور؟

source: Confirmation
ar: تأكيد

source: Are you sure you want to reboot immediately the computer ?
ar: هل أنت متأكد أنك تريد إعادة تشغيل الكمبيوتر على الفور؟

source: Are you sure you want to hibernate immediately the computer ?
ar: هل أنت متأكد أنك تريد إسبات الكمبيوتر على الفور؟

source: Current speech settings
ar: إعدادات النطق الحالية

source: Voice profile switch mode on
ar: التبديل لوضع ملف التعريف الصوتي تشغيل

source: Voice profile switch mode off
ar: التبديل لوضع الملف التعريف الصوتي إيقاف

source: Selector %s is free
ar: لم يتم تعريف أي صوت على %s

source: There was no change of input gesture made by the user
ar: لم يكن هناك تغيير في إيماءة الإدخال بواسطة المستخدم

source: Double left click
ar: نقرتين بزر الفأرة اليسرى

source: Object has no location
ar: ليس هناك موقع للكائن

source: Double right click
ar: نقرتين بزر الفأرة الأيمن

source: This functionnality is only available if "command keys selective announcement" functionnality or "keys's remanence" functionnality is installed
ar: لا تتوفر هذه الوظيفة إلا إذا تم تثبيت وظيفة "إعلان مفاتيح الأوامر الانتقائي" أو وظيفة "إعادة المفاتيح"

source: The standard use of the numeric keypad is not allowed
ar: لا يُسمح بالاستخدام القياسي للوحة المفاتيح الرقمية

source: Are you sure you want to close all windows?
ar: هل أنت متأكد أنك تريد إغلاق جميع النوافذ؟

source: global
ar: عالمي

source: application
ar: مفتاح التطبيقات

source: speech synthesizer driver
ar: محرك الصوت

source: braille display driver
ar: برنامج تشغيل شاشة برايل

source: mixed
ar: مختلط

source: %s add-on type:
ar: نوع الوظيفة الإضافية %s:

source: any
ar: أي

source: Running add-ons
ar: تشغيل الوظائف الإضافية

source: Text analysis not available
ar: تحليل النص غير متوفر

source: Nothing to report
ar: لا شيء للإبلاغ عنه

source: report current caret position on
ar: تشغيل الإبلاغ عن موضع علامة الإقحام الحالي

source: report current caret position off
ar: إيقاف الإبلاغ عن موضع علامة الإقحام الحالي

source: Clipboard is empty
ar: الحافظة فارغة

source: but the clipboard is not empty
ar: لكن الحافظة ليست فارغة

source: Clipboard cleared
ar: مسح الحافظة

source: Error: clipboard cannot cleared
ar: خطأ: لا يمكن مسح الحافظة

source: cycle is not possible on audio output device
ar: دورة غير ممكنة على جهاز إخراج الصوت

source: Shell's scripts
ar: الإختصارات

source: Description: command
ar: الوصف: الإختصار

source: &Execute the script
ar: &تنفيذ الإختصار

source: Start menu|Charm Bar
ar: قائمة إبدأ

source: List of windows
ar: قائمة النوافذ

source: Minimized
ar: تصغير

source: Maximized
ar: تكبير

source: Current &applications
ar: البرنام&ج الحالي

source: &Switch to
ar: &تبديل الى

source: &Destroy
ar: إغلا&ق النافذة

source: Destro&y all
ar: إن&هاء كل شيء

source: Impossible to destroy desktop window
ar: لا يمكن إغلاق نافذة سطح المكتب

source: Impossible to destroy the window
ar: لا يمكن إغلاق هذه النافذة

source: Warning
ar: تحذير

source: No label
ar: لا توجد تسمية

source: Form field
ar: حقول إستمارية

source: Report current table row's cells
ar: الإعلان عن موضع الصف في الخلية في الجدول الحالي

source: Report current table column's cells
ar: الإعلان عن موضع العمود في الخلية في الجدول الحالي

source: Move to and report next table row
ar: الإنتقال والإعلان عن الصف التالي في الجدول

source: Move to and report previous table row
ar: الإنتقال والإعلان عن الصف السابق في الجدول

source: Move to and report next table column
ar: الإنتقال والإعلان عن الصف التالي في الجدول

source: Move to and report previous table column
ar: الإنتقال والإعلان عن العمود السابق في الجدول

source: Report current table cell position
ar: الإعلان عن الموضع الحالي للخلية في الجدول

source: Move to first cell of table row
ar: الانتقال إلى الخلية الأولى من الجدول الصف

source: Move to last cell of table row
ar: الانتقال إلى الخلية الأخيرة من صف الجدول

source: Move to first cell of table column
ar: الانتقال إلى الخلية الأولى من العمود

source: Move to last cell of table column
ar: الانتقال إلى الخلية الأخيرة في عمود الجدول

source: Anchor
ar: الخلاصات

source: %s elements
ar: %s العناصر

source: One element
ar: عنصر واحد

source: no element
ar: لا توجد عناصر

source: moves to the next paragraph
ar: ينتقل إلى الفقرة التالية

source: no next paragraph
ar: لا توجد فقرة تالية

source: moves to the previous paragraph
ar: ينتقل إلى الفقرة السابقة

source: no previous paragraph
ar: لا توجد فقرة سابقة

source: moves to the next division
ar: ينتقل إلى القسم التالي

source: no next division
ar: لا يوجد قسم تالي

source: moves to the previous division
ar: ينتقل الى القسم السابق

source: no previous division
ar: لا يوجد قسم سابق

source: moves to the next main landmark
ar: ينتقل الى العلامة التالية

source: no next main landmark
ar: لا توجد علامة دلالية تالية

source: moves to the previous main landmark
ar: ينتقل الى العلامة السابقة

source: no previous main landmark
ar: لا توجد علامة دلالية سابقة

source: moves to the next clickable element
ar: ينتقل الى الكائن التالي يمكن نقره

source: no next clickable element
ar: لا توجد عناصر تالية يمكن نقرها

source: moves to the previous clickable element
ar: ينتقل الى الكائن السابق يمكن نقره

source: no previous clickable element
ar: لا توجد عناصر سابقة يمكن نقرها

source: Copied to clipboard
ar: تم النسخ إلى الحافظة

source: Cannot copy to clipboard
ar: لا يمكن النسخ إلى الحافظة

source: Report document 's address (URL). Twice: copy it to clipboard
ar: الإعلان عن عنوان الرابط بالضغط مرتين يتم نسخه

source: Return to bottom of page
ar: العودة الى أسفل الصفحة

source: Return to top of page
ar: العودة الى أعلى الصفحة

source: No text to add
ar: لا يوجد نص لإضافته

source: Do you want realy add the selected text to the clipboard?
ar: هل تريد بالفعل إضافة النص المحدد إلى الحافظة؟

source: Adding text to clipboard
ar: إضافة نص إلى الحافظة

source: Added
ar: تمت الإضافة

source: Cannot add
ar: لا يمكن الإضافة

source: Cut
ar: قص

source: Paste
ar: لصق

source: Copy
ar: نسخ

source: Undo
ar: تراجع

source: select all
ar: تحديد الكل

source: one selected object
ar: تحديد كائن واحد

source: %s selected objects
ar: %s الكائنات المحددة

source: Any key with modifier key combination
ar: أي مفتاح مع مجموعة مفاتيح التعديل

source: Keys's remanence activation on
ar: تشغيل ثبات المفاتيح

source: Keys's remanence activation off
ar: إيقاف ثبات المفاتيح

source: Standard use of the numeric keypad enabled
ar: الاستخدام القياسي للوحة المفاتيح الرقمية مفعله

source: Standard use of the numeric keypad disabled
ar: الاستخدام القياسي للوحة المفاتيح الرقمية معطلة

source: Command keys selective Announcement
ar: قائمة ازرار لوحة المفاتيح

source: Check &excluded keys:
ar: الت&حقق من من حالة المفاتيح

source: Pressed W&ith modifier key combination:
ar: ال&ضغط مع مجموعة مفاتيح التعديل:

source: &Check all modifier combinations
ar: &تحديد كافة تركيبات المُعدِلات

source: &Uncheck all modifier combinations
ar: &قم بإلغاء تحديد كافة تركيبات المعدلات

source: Do not speak command &keys
ar: &لا تنطق أسماء المفاتيح

source: Do you want to save changes made in "%s" mode?
ar: هل تريد حفظ التغييرات التي تم إجراؤها في وضع " %s"؟

source: No more checked command key
ar: لا يوجد المزيد من المفاتيح

source: Help for complex symbols edition
ar: مساعدة لتحرير الرموز المعقدة

source: &Categories:
ar: الت&صنيفات

source: S&ymbols:
ar: الروم&ز

source: &Copy to clipboard
ar: &نَسخ إلى الحافظة

source: &Paste
ar: &لصق

source: &Manage your symbols
ar: إ&دارة رموز

source: No symbol selected
ar: لم يتم تحديد الرمز

source: {0} pasted
ar: تم لصق {0}

source: Symbol cannot copied to the clipboard
ar: لا يمكن نسخ الرمز الى الحافظة

source: {0} copied
ar: {0} تم النسخ

source: Error: no basic symbols installed
ar: خطأ: لا توجد الرموز الأساسية المثبتة

source: User symbols manager
ar: إدارة رموز المستخدم

source: &Add a symbol
ar: إ&ضافة رمز

source: &Delete the symbol
ar: &حذف الرمز

source: Add a &category
ar: إضافة ت&صنيف

source: De&lete the category
ar: ح&ذف تصنيف

source: &Save
ar: حف&ظ

source: %s symbol deleted
ar: %s حذف الرمز

source: No symbol entered
ar: لم يتم إدخال رمز

source: Symbol is not valid
ar: الرمز غير صالح

source: There is no description for the symbol
ar: لا يوجد وصف لهذا الرمز

source: The symbol is already in this category under "%s" description. Do you want to replace it?
ar: الرمز موجود بالفعل في هذه الفئة تحت وصف %s". هل تريد استبدالها؟

source: The symbol is allready in "{oldCat}" category. Do you want to add this symbol also in "{newCat}" category?
ar: الرمز موجود بالفعل في فئة "{oldCat}". هل تريد إضافة هذا الرمز أيضًا في فئة "{newCat}"؟

source: %s symbol has been added
ar: تمت إضافة الرمز %s

source: Enter category name:
ar: أدخل اسم الفئة:

source: Adding category
ar: أضف التصنيف

source: "%s" category already exists
ar: الفئة "%s" موجودة بالفعل

source: You cannot delete this basic category.
ar: لا يمكنك حذف هذا التصنيف الأساسي؟

source: Do you really want to delete this category and all its symbols?
ar: هل تريد حقا حذف هذه الفئة وجميع رموزها؟

source: "%s" category has been deleted
ar: تم حذف فئة "%s"

source: Adding Symbol in %s category
ar: إضافة رمز في %s التصنيف

source: Enter the Symbol:
ar: أدخل الرمز:

source: Enter the Description:
ar: أدخل الوصف:

source: Last used complex symbols
ar: آخر الرموز المعقدة المستخدمة

source: &Symbols:
ar: الرمو&ز:

source: &Past
ar: &المسار

source: &Delete all
ar: حذف ال&كل

source: Do you really want to delete all symbols of the list?
ar: هل تريد حقًا حذف كافة رموز القائمة؟

source: There is no symbol recorded
ar: لا يوجد رمز مسجل

source: Open
ar: فتح

source: Save
ar: حفظ

source: Save as
ar: حفظ بأسم

source: Find in
ar: البحث في

source: Selected folder name not found
ar: لم يتم العثور على اسم المجلد المحدد

source: Folder %s
ar: المجلد %s

source: Temporary Audio device manager
ar: مدير جهاز الصوت المؤقت

source: Current temporary audio device: %s
ar: جهاز الصوت المؤقت الحالي: %s

source: None
ar: بلا

source: Select a &device:
ar: ا&ختر جهازا:

source: &Set as temporary audio device
ar: & تعيين كجهاز صوتي مؤقت

source: &leave up the temporary audio device
ar: &مغادرة جهاز الصوت المؤقت

source: Confirm
ar: تأكيد

source: You have %s seconds to accept the use of this audio device for all configuration profiles regardless of the choice made in their voice settings
ar: لديك %s ثانية لقبول استخدام جهاز الصوت هذا لكافة ملفات تعريف التكوين بغض النظر عن الاختيار الذي تم إجراؤه في إعدادات الصوت الخاصة بهم

source: &Accept
ar: &قبول

source: NVDA and running Applications audio manager
ar: تشغيل مدير صوت التطبيقات, وnvda

source: Applications:
ar: التطبيقات:

source: Volume
ar: المستوى

source: &Volume:
ar: مستوى الصوت:

source: &Muted
ar: مكتوم:

source: Balance
ar: الموازنة:

source: &Left:
ar: يسار:

source: &Right:
ar: يمين:

source: refresh terminated
ar: تم إنهاء التحديث

source: Please wait, refreshing list
ar: قائمة التحديث الرجاء الإنتظار ،

source: mute
ar: كتم

source: Volume changes are not available for NVDA
ar: تغيير مستوى الصوت غير متوفرل nvda

source: unmute
ar: إلغاء الكتم

source: The volume of NVDA channels cannot be zero both simultaneously
ar: لا يمكن أن يكون حجم قنوات NVDA صفرًا في نفس الوقت

source: Not available cause of conflict with another add-on. See NVDA log
ar: سبب التعارض غير متوفر مع وظيفة إضافية أخرى. راجع سجل NVDA

source: Computer shutdown
ar: اغلاق الكمبيوتر

source: &Hibernate
ar: وضع الإ&ثبات

source: &Shutdown
ar: إي&قاف التشغيل

source: &Reboot
ar: إعا&دة تشغيل

source: F&orce running programs to close without warning
ar: إيقاف البرامج إ&جباري

source: &Delay before shutdown or reboot between {min} and {max} seconds
ar: التأ&خير قبل إيقاف التشغيل أو إعادة التشغيل بين {min} و {max} ثانية

source: Computer Shutdown
ar: اغلاق الكمبيوتر

source: Computer reboot
ar: إعادة تشغيل الكمبيوتر

source: Computer hibernation
ar: إسبات الكمبيوتر

source: Number of seconds to wait before shutdown:
ar: عدد الثواني التي يجب انتظارها قبل إيقاف التشغيل:

source: Number of seconds to wait before reboot:
ar: عدد الثواني التي يجب انتظارها قبل إعادة التشغيل:

source: Number of seconds to wait before hibernation:
ar: عدد الثواني التي يجب انتظارها قبل وضع السبات:

source: &Report remaining time
ar: &تقرير الوقت المتبقي

source: Remaining time: %s seconds
ar: الوقت المتبقي: %s ثانية

source: Shut down ...
ar: إيقاف التشغيل ...

source: Computer's rebooting ...
ar: جاري إعادة تشغيل الكمبيوتر ...

source: Hibernate isn't available. So, sleep mode is activated.
ar: الإسبات غير متوفر. لذلك ، يتم تنشيط وضع السكون.

source: Main volume
ar: مستوى الصوت الرئيسي

source: to left
ar: الى اليسار

source: to right
ar: إلى اليمين

source: in center
ar: في المنتصف

source: Volume on
ar: تشغيل الصوت

source: volume off
ar: كتم الصوت

source: No audio controller for this application
ar: لا يوجد صوت للتحكم فيه لهذا التطبيق

source: Impossible, the volume level cannot be lower than the configured recovery threshold equal to %s
ar: غير ممكن ، لا يمكن أن يكون مستوى الصوت أقل من عتبة الاسترداد المكونة والتي تساوي %s

source: stronger on the right
ar: أقوى على اليمين

source: stronger on the left
ar: أقوى على اليسار

source: NVDA {to}, {app} {appTo}
ar: برنامج NVDA {to}, {app} {appTo}

source: NVDA {to} and all applications {appTo}
ar: NVDA {to} وجميع التطبيقات {appTo}

source: NVDA and {app} {to}
ar: NVDA و {app} {to}

source: NVDA and all applications {appTo}
ar: NVDA وكافة التطبيقات {appTo}

source: Volume control
ar: التحكم في مستوى الصوت

source: Set the volume of current focused application to %s percent
ar: قم بتعيين حجم التطبيق المركز الحالي على %s بالمائة

source: Set the main volume to %s
ar: قم بتعيين حجم الصوت الرئيسي على %s

source: Unavailable for NVDA
ar: غير متوفر لبرنامج nvda
